Repository: JGroot/angular_b2c_internationalization
Catalog: src/locale/messages.*.xlf
Languages: fr_fr

source: Sample Page
fr_fr: Page d'exemple

source: Edit Profile
fr_fr: Editer le profil

source: Login
fr_fr: S'identifier

source: Logout
fr_fr: Connectez - Out

source: Login failed. Please try again.
fr_fr: Echec de la connexion. Veuillez réessayer.

source: Go back
fr_fr: Retourner

source: Welcome to the MSAL.js v2 Angular Quickstart!
fr_fr: Bienvenue dans le Quickstart MSAL.js v2 Angular !

source: This sample demonstrates how to configure MSAL Angular to login, logout, protect a route, and acquire an access token for a protected resource such as a B2C protected web API.
fr_fr: Cet exemple montre comment configurer MSAL Angular pour se connecter, se déconnecter, protéger une route et acquérir un jeton d'accès pour une ressource protégée telle qu'une API Web protégée B2C.

source: Please sign-in to acquire a token and make an API call.
fr_fr: Veuillez vous connecter pour acquérir un jeton et effectuer un appel API.

source: Login successful!
fr_fr: Connexion réussie!

source: Request your profile information by clicking Web API above.
fr_fr: Demandez vos informations de profil en cliquant sur API Web ci-dessus.

source: Profile
fr_fr: Profil

source: Jaguar shark! So tell me - does it really exist? Life finds a way. Yes, Yes, without the oops! My dad once told me, laugh and the world laughs with you, Cry, and I'll give you something to cry about you little bastard! Jaguar shark! So tell me - does it really exist?
fr_fr: Requin jaguar! Alors dites-moi - existe-t-il vraiment? La vie trouve un moyen. Oui, oui, sans les oups! Mon père m’a dit un jour, rire et le monde rit avec toi, pleure, et je vais te donner quelque chose à pleurer sur toi petit bâtard! Requin jaguar! Alors dites-moi - existe-t-il vraiment?

source: Hey, take a look at the earthlings. Goodbye! Checkmate... Must go faster... go, go, go, go, go! We gotta burn the rain forest, dump toxic waste, pollute the air, and rip up the OZONE! 'Cause maybe if we screw up this planet enough, they won't want it anymore!
fr_fr: Hé, jetez un coup d’œil aux terriens. Au revoir! Échec et mat... Doit aller plus vite... allez, allez, allez, allez, allez! Nous devons brûler la forêt tropicale, déverser des déchets toxiques, polluer l’air et déchirer l’OZONE! Parce que peut-être que si nous gâchons assez cette planète, ils n’en voudront plus!

source: I was part of something special. Just my luck, no ice. Eventually, you do plan to have dinosaurs on your dinosaur tour, right? Checkmate... Checkmate... What do they got in there? King Kong? God help us, we're in the hands of engineers. Yes, Yes, without the oops!
fr_fr: Je faisais partie de quelque chose de spécial. Juste ma chance, pas de glace. Finalement, vous prévoyez d’avoir des dinosaures lors de votre tournée des dinosaures, n’est-ce pas? Échec et mat... Échec et mat... Qu’est-ce qu’ils ont là-dedans? King Kong ? Que Dieu nous aide, nous sommes entre les mains d’ingénieurs. Oui, oui, sans les oups!

source: So you two dig up, dig up dinosaurs? So you two dig up, dig up dinosaurs? Jaguar shark! So tell me - does it really exist? Yeah, but your scientists were so preoccupied with whether or not they could, they didn't stop to think if they should. Yeah, but your scientists were so preoccupied with whether or not they could, they didn't stop to think if they should.
fr_fr: Alors vous deux déterrez, déterrez des dinosaures? Alors vous deux déterrez, déterrez des dinosaures? Requin jaguar! Alors dites-moi - existe-t-il vraiment? Oui, mais vos scientifiques étaient tellement préoccupés par le fait de savoir s’ils le pouvaient ou non qu’ils ne se sont pas arrêtés pour penser s’ils le devaient. Oui, mais vos scientifiques étaient tellement préoccupés par le fait de savoir s’ils le pouvaient ou non qu’ils ne se sont pas arrêtés pour penser s’ils le devaient.

source: You really think you can fly that thing? Eventually, you do plan to have dinosaurs on your dinosaur tour, right? Must go faster. You're a very talented young man, with your own clever thoughts and ideas. Do you need a manager? They're using our own satellites against us. And the clock is ticking.
fr_fr: Vous pensez vraiment que vous pouvez piloter cette chose? Finalement, vous prévoyez d’avoir des dinosaures lors de votre tournée des dinosaures, n’est-ce pas? Doit aller plus vite. Vous êtes un jeune homme très talentueux, avec vos propres pensées et idées intelligentes. Avez-vous besoin d’un gestionnaire? Ils utilisent nos propres satellites contre nous. Et l’horloge tourne.
